lab85-ru/terraelectronica_boards/te-tm4c123/Soft/TE-TM4C123-DEMO/blinky/blinky.c
//*****************************************************************************
//
// blinky.c - Simple example to blink the on-board LED.
//
// Copyright (c) 2011-2013 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 1.1 of the DK-TM4C123G Firmware Package.
//
//*****************************************************************************

#include <stdint.h>
#include "inc/TM4C123GH6PZ.h"

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>Blinky (blinky)</h1>
//!
//! A very simple example that blinks the on-board LED.
//
//*****************************************************************************

//*****************************************************************************
//
// Blink the on-board LED.
//
//*****************************************************************************
int
main(void)
{
    volatile uint32_t ulLoop;

    //
    // Enable the GPIO port that is used for the on-board LED.
    //
    SYSCTL_RCGC2_R = SYSCTL_RCGC2_GPIOG;

    //
    // Do a dummy read to insert a few cycles after enabling the peripheral.
    //
    ulLoop = SYSCTL_RCGC2_R;

    //
    // Enable the GPIO pin for the LED (PG2, PG3, PG6, PG7).  Set the direction as output, and
    // enable the GPIO pin for digital function.
    //
    GPIO_PORTG_DIR_R = 0xCD;
    GPIO_PORTG_DEN_R = 0xCD;
    GPIO_PORTG_DATA_R |= 0x01;

    //
    // Loop forever.
    //
    while(1)
    {
        GPIO_PORTG_DATA_R |= 0x80;
        GPIO_PORTG_DATA_R &= ~(0x40);
        GPIO_PORTG_DATA_R &= ~(0x08);
        GPIO_PORTG_DATA_R &= ~(0x04);

        //
        // Delay.
        //
        for(ulLoop = 0; ulLoop < 2000000; ulLoop++)
        {
        }

        GPIO_PORTG_DATA_R |= 0x40;
        GPIO_PORTG_DATA_R &= ~(0x80);
        GPIO_PORTG_DATA_R &= ~(0x08);
        GPIO_PORTG_DATA_R &= ~(0x04);

        //
        // Delay.
        //
        for(ulLoop = 0; ulLoop < 2000000; ulLoop++)
        {
        }
         GPIO_PORTG_DATA_R |= 0x04;
        GPIO_PORTG_DATA_R &= ~(0x80);
        GPIO_PORTG_DATA_R &= ~(0x40);
        GPIO_PORTG_DATA_R &= ~(0x08);

        //
        // Delay.
        //
        for(ulLoop = 0; ulLoop < 2000000; ulLoop++)
        {
        }
        GPIO_PORTG_DATA_R |= 0x08;
        GPIO_PORTG_DATA_R &= ~(0x80);
        GPIO_PORTG_DATA_R &= ~(0x04);
        GPIO_PORTG_DATA_R &= ~(0x40);

        //
        // Delay.
        //
        for(ulLoop = 0; ulLoop < 2000000; ulLoop++)
        {
        }
    }
}
